app/views/cables/_form.html.erb

SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "44"]]
---
      <br/>
      <%= f.select :server_id, Server.find(:all, :order => "name").collect { |server| [server.name, server.id] } %>