app/views/servers/_public_index.erb

        <td><%= server.MAC %></td>
        <td><%= server.cables.count %></td>
---
SELECT COUNT(*) FROM "cables" WHERE "cables"."server_id" = 46