app/controllers/cables_controller.rb

SELECT "cables".* FROM "cables" WHERE "cables"."server_id" = 44 AND "cables"."id" = ? LIMIT 1  [["id", "4"]]
---
  def show
    @cable = @server.cables.find(params[:id])

SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "44"]]
---
  def new
    @server = Server.find (params[:server_id])

SELECT "cables".* FROM "cables" WHERE "cables"."server_id" = 44 AND "cables"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @cable = @server.cables.find(params[:id])

INSERT INTO "cables" ("color", "created_at", "from_nic", "server_id", "to_end", "to_nic", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["color", ""], ["created_at", Tue, 06 Aug 2013 21:50:39 UTC +00:00], ["from_nic", ""], ["server_id", 1], ["to_end", ""], ["to_nic", ""], ["updated_at", Tue, 06 Aug 2013 21:50:39 UTC +00:00]]
---
  def create
    @cable = @server.cables.build(params[:cable])

    respond_to do |format|
      if @cable.save

SELECT "cables".* FROM "cables" WHERE "cables"."server_id" = 46 AND "cables"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "cables" SET "color" = 'yellow', "updated_at" = '2013-08-07 08:34:21.189475' WHERE "cables"."id" = 13
---
  def update
    @cable = @server.cables.find(params[:id])

    respond_to do |format|
      if @cable.update_attributes(params[:cable])

SELECT "cables".* FROM "cables" WHERE "cables"."server_id" = 43 AND "cables"."id" = ? LIMIT 1  [["id", "10"]]
DELETE FROM "cables" WHERE "cables"."id" = ?  [["id", 2]]
---
  def destroy
    @cable = @server.cables.find(params[:id])
    @cable.destroy