app/controllers/servers_controller.rb

  def index
    @servers = Server.search (params[:search])
---
SELECT "servers".* FROM "servers" WHERE (name == '%IE-ESXLAB-14%' OR QR_code = '%IE-ESXLAB-14%')

  def show
    @server = Server.find(params[:id])
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @server = Server.find(params[:id])
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    #@server.QR_code = Server.qr
    @server = Server.new(params[:server])
    @server.QR_code = Server.qr

    respond_to do |format|
      if @server.save
---
INSERT INTO "servers" ("CPU", "IDR", "IP", "MAC", "QR_code", "RAM", "Storage", "created_at", "extension", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @server = Server.find(params[:id])

    respond_to do |format|
      if @server.update_attributes(params[:server])
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "servers" SET "IDR" = 'asdfasdfasdfasdfasdfasdfasdfasdf', "updated_at" = '2013-07-18 13:53:51.546213' WHERE "servers"."id" = 1

  def destroy
    @server = Server.find(params[:id])
    @server.destroy
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT 1  [["id", "9"]]
DELETE FROM "servers" WHERE "servers"."id" = ?  [["id", 9]]