app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    if (User.find_by_provider_and_uid(auth["provider"], auth["uid"]))
      user = User.find_by_provider_and_uid(auth["provider"], auth["uid"])
    else
      user = User.create_with_omniauth(auth)
---
SELECT "users".* FROM "users" WHERE "users"."provider" = 'identity' AND "users"."uid" = '3' LIMIT 1
INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 11 Aug 2013 15:57:11 UTC +00:00], ["name", "Test"], ["provider", "identity"], ["uid", "3"], ["updated_at", Sun, 11 Aug 2013 15:57:11 UTC +00:00]]